[
  {
    "body": "I ordered this for two main reasons - price point and size. That it's also an attractive fridge, is a bonus. I have a small galley kitchen and wanted something that wouldn't overwhelm the space, so that all you notice is the fridge. This fit the bill. Also, this doesn't stick out past the counters as much as some others. That was important to me. Counterdepth fridges were too much compromise on storage space for me. For the size, it's got the best storage capacity compared to other ones I was looking at. I like the smooth finish on the doors. It's pretty. If I had my druthers, I think I would have liked to have a side by side - freezer on one side and fridge on the other. But this is a good compromise, considering the price and space I have to work with. Make sure you have space to fully open the doors. I have a wall on one side and a cabinet on the other side. On the cabinet side, the fridge extends 4 1/2\" past the counter edge. Any less clearance than that would not allow the door to open fully without bumping the countertop. On the wall side, I have 5 1/2\" between the wall and fridge. The door opens ALMOST all the way. It works and I can get shelves and bins out for cleaning and stuff, but I could probably have done with another 1/2 to 1 inch. I'd say, optimally, you need at least 6\" between a wall and the fridge. I love the inside setup and so far, I'm happy with it. It seems to be running well, and I did buy the warranty. Temp controls are a little confusing but I haven't taken much time to figure it out yet. Seems like a good value for the money at this point.",
    "title": "Good value for the money",
    "location": "the United States",
    "date": " June 30, 2022",
    "verified": true,
    "star_rating": "4.0"
  },
  {
    "body": "This fridge has an upscale look and due to its height it fills out the cabiet space nicely. It's fairly quiet. I like the look of the doors without handles but you should know that that results in smudgy fingerprints. The doors have hidden pulls on the top and bottom but people reflexively handle the doors and they show the prints pretty obviously.",
    "title": "Rare 3 door 30\" wide fridge",
    "location": "the United States",
    "date": " June 30, 2022",
    "verified": true,
    "star_rating": "4.0"
  },
  {
    "body": "My refrig died and I needed a new one ASAP.  Not much choice in narrow, white models and nothing available locally for over a month.  Who knew you could buy a frig on Amazon and have it delivered in 3 days?  So happy about that and for $20 extra they wheeled it into my kitchen and even took the packing materials.  I have never had a French door/freezer on the bottom and I love it.  Freezer has plenty of room (compared to my old side by side) and love the width of the frig.  It's working fine after a month.  Only small complaint - light in the frig section could be brighter.",
    "title": "Perfect size for apartment",
    "location": "the United States",
    "date": " May 17, 2022",
    "verified": true,
    "star_rating": "4.0"
  },
  {
    "body": "The freezer bin is exactly what I wanted.The only thing is, the manual/instruction book is not translated from Chinese properly.Figuring out what to do to adust temps, instructions way too unclear.",
    "title": "Just love the roll-out freezer bin at the bottom!!!",
    "location": "the United States",
    "date": " July 2, 2022",
    "verified": true,
    "star_rating": "4.0"
  },
  {
    "body": "I have a new refrigerator! The old one was purchased more than 27 years ago, and though it was still mostly functional, I began looking for a replacement in May. Last year I replaced my stove and it took weeks, and I didn't want to repeat that experience! But every time I thought I found a unit that would fit my space, budget and desires, it was on backorder, often for months. A few days ago I joked about getting one from Amazon. Just for minor amusement value, I put \"refrigerator\" in the search bar. And there it was, everything I needed for a reasonable price AND they got it to me in 8 days. I gave it 4 stars because it is still very early in the relationship and also because it has made a noise in a door as it closed. No visible problem, and it hasn't been opened a lot yet. Today is the first day of usage, so it is subject to change. But so far I am happy with it. It is sleek, quiet and seems to be just what we needed. I didn't know Amazon sold major appliances. Lesson learned, lol!",
    "title": "After all this time....",
    "location": "the United States",
    "date": " October 12, 2021",
    "verified": true,
    "star_rating": "4.0"
  },
  {
    "body": "7/2021 NEVER AGAIN.Top part worked May/June. Freezer never cooled down. July top part stopped cooling past 40’s. Called Galanz numerous times over the past month for a service request. Didn’t think to ask for a ticket number because they know my name/num/address which is all tied to calls and account. You get their overflow call center when you call. If you miss their call when they call you back, you have to call back to get in line again with their overflow call center. I never got to speak to anyone on a call that I initiated. They always say, we’ll all you back. Too bad and never mind if youre an adult with a job where you cant be glued to your phone.Today they finally say they *cannot* help me. They gave a number for service. Service tells me the roller coaster issue is a lost cause.  “Call Galanz back ma’am” Galanz tells me mail the following: cut the plug off, bag it, take the serial number stickers off, any stickers, mail them by USPS only. In 8-10 wks you’ll be issued a check for the base price minus taxes. You dispose of the machine at your own cost.”So what shall I do without a fridge for 8-10 wks? I have to to pay for its disposal and no refund on taxes and warranty cost? Assurant would not step in to help because it was less than a year.I would not recommend to anyone!5/2021I like how sleek it looks. Love the doors and freezer on the bottom. Has tiny casters/wheels that I hope hold up and are nice to my wooden floors.Just one tiny issue, i am missing a tiny couple of screws that go into the handle and tighten with a small wrench. I called amazon and they tried to say they would send a whole new fridge. Completely unnecessary for something found within the fridge packaging. Called and left a message. Never got a call back.",
    "title": "Big let down. Never again.",
    "location": "the United States",
    "date": " May 8, 2021",
    "verified": true,
    "star_rating": "5.0"
  },
  {
    "body": "I bought this frig August 2021, an unknown brand to me. It has the bottom freezer i was wanting and the size i wanted also. And in white, which is hard to find. The price was very good. It has been very good. It runs quietly. Maintains the preferred temperature with a digital temp control. The freezer is very roomy. There's also a kind of extra seal attached to the left frig door. Roomy condiment shelves in the doors and a cool glass shelf that seperates into two narrow half shelves. Also very handy. I waited to do the review to see how it lasts. Its been great. Not one problem. I would buy it again and recommend to others. I dont know if its cost effective as far as electric usage because i dont have one to compare it to.",
    "title": "Very pleased with this purchace",
    "location": "the United States",
    "date": " May 28, 2022",
    "verified": true,
    "star_rating": "5.0"
  },
  {
    "body": "Great size for the price",
    "title": "Works well and love the space",
    "location": "the United States",
    "date": " June 18, 2022",
    "verified": true,
    "star_rating": "4.0"
  },
  {
    "body": "Good price. French doors are squeaky to open and mine came damaged (see dent in right door) but it keeps food cold!Overall its about what I expect for the price but I was disappointed Amazon hasn't gotten back to me about what to do about the dent. I'm a bit scared to hit return since we destroyed the packaging as we unloaded it and it'll be a right pain to get it in and out of the house again. Anyone else been in this dilemma?",
    "title": "Product damaged on arrival",
    "location": "the United States",
    "date": " May 30, 2022",
    "verified": true,
    "star_rating": "3.0"
  },
  {
    "body": "I never thought I would purchase an appliance from AMZN, but I could not find anything else under 30” width that I liked.I waited to review the performance so I could give an accurate review. It arrived with a couple of tiny packing dents on the left door so I was refunded a small portion of $$ and I kept it.You will need an extra few inches in width to accommodate the full opening of the double doors. Remember, the delivery option is just basically drop and go but does not include set-up or connecting the ice-maker.If you plan on using that feature, be sure you have an actual installer with you upon delivery. You will also need to attach the handles to the doors with the tools provided.Very happy with the craftsmanship and the performance so far. The wheels on the bottom seem very sturdy and makes it easy to maneuver.  BRAVO !!",
    "title": "SO FAR SO GOOD !",
    "location": "the United States",
    "date": " November 4, 2021",
    "verified": true,
    "star_rating": "5.0"
  },
  {
    "body": "I didn't had the pleasure of keeping the fridge because the incompetent delivery personnel damaged one of the doors and scraped both sides..I would have loved to enjoy it, because it is a beautiful refrigerator, very slim but tall..spacious.",
    "title": "Beautiful tall ad slim refrigerator",
    "location": "the United States",
    "date": " July 6, 2022",
    "verified": true,
    "star_rating": "5.0"
  },
  {
    "body": "Very loud. I hear this thing from the second floor of my house. It was damaged when it arrived. The lights are very dim. The ice maker is super slow. And, you have to open both doors to access the left crisper drawer. Extremely disappointed. Will try to return for sure.",
    "title": "Avoid. Noisy, dim lights, poor design.",
    "location": "the United States",
    "date": " September 17, 2022",
    "verified": true,
    "star_rating": "2.0"
  },
  {
    "body": "We received our fridge with a broken glass shelf, which wasn’t nice to open and all the glass to scatter through my kitchen. A lot narrow than I thought, very beautiful but not much space for storage.",
    "title": "Smaller than what I thought.",
    "location": "the United States",
    "date": " January 4, 2022",
    "verified": true,
    "star_rating": "4.0"
  },
  {
    "body": "Only complaints are there was a small dent on the top of fridge and the door on the left makes a loud noise when it is opened and closed.",
    "title": "Nice roomy stainless steel refrigerator",
    "location": "the United States",
    "date": " January 11, 2022",
    "verified": true,
    "star_rating": "4.0"
  },
  {
    "body": "Fridge is beautiful and git cold within thirty minutes and the Amazon delivery man was nice and carful with delivery as he put fridge in my room of choice, was in the kitchen.Unfortunately, when I took off boxing and plastic, the lower right door of fridge was bent.",
    "title": "Fridge was damaged on right side of lower door",
    "location": "the United States",
    "date": " June 5, 2022",
    "verified": true,
    "star_rating": "5.0"
  },
  {
    "body": "The frige seems to be fine I've only had it a day, my issue is with Amazon delivery service. They need to hire  experience movers. I had to hire an 3rd party movers to bring frige upstair!",
    "title": "Delivery service for heay items. Not so good",
    "location": "the United States",
    "date": " November 14, 2021",
    "verified": true,
    "star_rating": "4.0"
  },
  {
    "body": "I purchased this refrigerator until my built in units arrive (estimated to take 1 year). Even though it’s meant to be temporary, I’m disappointed with the build quality. The French doors are not even, the unit cannot be leveled without using shims in the back (my floor is level. . . I checked),and the unit also came damaged from shipping.  So far, it seems to maintain temperature. Hopefully it will last for the year I’ll need it.",
    "title": "Arrived damaged. Can’t level.",
    "location": "the United States",
    "date": " May 26, 2022",
    "verified": true,
    "star_rating": "2.0"
  },
  {
    "body": "Bought this for my grandma and she loves it. Hold all her food and it’s easy to access everyt Inside.",
    "title": "Looks good, great for a small space.",
    "location": "the United States",
    "date": " May 24, 2022",
    "verified": true,
    "star_rating": "5.0"
  },
  {
    "body": "I personally dislike ice makers so this works perfectly for us . ( Elderly people have trouble bending over.)  I’m very pleased with this size for our small retirement cottage.",
    "title": "Don’t have to bend over to get your daily food.",
    "location": "the United States",
    "date": " April 4, 2022",
    "verified": true,
    "star_rating": "5.0"
  },
  {
    "body": "",
    "title": "The only reason I gave a 4 is Because it has many dent may be its from shipping",
    "location": "the United States",
    "date": " October 25, 2021",
    "verified": true,
    "star_rating": "4.0"
  },
  {
    "body": "From day one, it was a disappointment to find that the exterior walls were hot to the touch and after 5 months, the refrigerator stopped working. I have contacted the vendor several times with no answer to my inquiries.",
    "title": "Galanz French Door",
    "location": "the United States",
    "date": " September 28, 2022",
    "verified": true,
    "star_rating": "1.0"
  },
  {
    "body": "Arrived earlier than expected with no damage.Quiet operation and easy temperature control.Efficient interior Design & illumination.Very simple & well designed.",
    "title": "Excellent Quality & Design",
    "location": "the United States",
    "date": " January 7, 2022",
    "verified": true,
    "star_rating": "5.0"
  },
  {
    "body": "Haven't had long but so far so good!!",
    "title": "Nice frig for the money.",
    "location": "the United States",
    "date": " July 3, 2021",
    "verified": true,
    "star_rating": "4.0"
  },
  {
    "body": "Delivered quickly.  Was \"dumped\" off in front of my garage door but the packaging was good and no damage.  It has been running quietly and efficiently for 5 months.  I would recommend the product.",
    "title": "Good Product",
    "location": "the United States",
    "date": " November 10, 2021",
    "verified": true,
    "star_rating": "5.0"
  },
  {
    "body": "It arrived on time, and preforms as advetised.  Note that as with any fridge / freezer you will need to give it several hours to cool down before using it.  It works very well.",
    "title": "Good no frills unit",
    "location": "the United States",
    "date": " September 22, 2021",
    "verified": true,
    "star_rating": "5.0"
  },
  {
    "body": "So far so good, I've only had it a month or so. The delivery was great, came in 4 days!",
    "title": "nice fridge",
    "location": "the United States",
    "date": " November 19, 2021",
    "verified": true,
    "star_rating": "5.0"
  },
  {
    "body": "The item arrived damaged. Once I reached out, they resolved the issue quickly. They are a stand up company that I will purchase from again. The refrigerator itself is great and I would recommend it highly.",
    "title": "Customer support",
    "location": "the United States",
    "date": " September 6, 2021",
    "verified": true,
    "star_rating": "5.0"
  },
  {
    "body": "01-05-22Finally got an email notifying me that the request has been handed off to local a service technician.  Have not been contacted yet as to when they will actually come out to fix the refrigerator.12-28-21Still no word back from the service rep, sent an email about a week ago with no updates so far. Nearly a month of waiting without a refrigerator.12-17-212 weeks of waiting, still no fridge to use, for a service rep to contact me about when they will fix the fridge. Called them about a week ago and no progress.12-02-216 months in and the fridge has already failed. Customer service has been great!I have a feeling it’ll fail in another 6 months just outside of warranty.  I’ll be taking notes when the tech is here for repairs.",
    "title": "Failed already!",
    "location": "the United States",
    "date": " December 2, 2021",
    "verified": true,
    "star_rating": "1.0"
  },
  {
    "body": "Seems like a great fit for our 3 person family. Nice that it fits in our older kitchen but has modern features. All parts included and seems to run quiet. Odd that it was delivered with the incorrect invoice though.",
    "title": "Nice fit for a small space",
    "location": "the United States",
    "date": " June 2, 2021",
    "verified": true,
    "star_rating": "5.0"
  },
  {
    "body": "Excellent Good choice",
    "title": "Excellent",
    "location": "the United States",
    "date": " January 22, 2022",
    "verified": true,
    "star_rating": "5.0"
  },
  {
    "body": "The refrigerator is working great so far.  The  cosmetic side of things is terrible.",
    "title": "Delivered with 2 dents and a long scratch on the front door.",
    "location": "the United States",
    "date": " June 8, 2021",
    "verified": true,
    "star_rating": "3.0"
  },
  {
    "body": "High quality!",
    "title": "High quality",
    "location": "the United States",
    "date": " October 26, 2021",
    "verified": true,
    "star_rating": "5.0"
  },
  {
    "body": "Several dents…",
    "title": "Severely damaged",
    "location": "the United States",
    "date": " August 29, 2022",
    "verified": true,
    "star_rating": "1.0"
  },
  {
    "body": "None",
    "title": "Service",
    "location": "the United States",
    "date": " October 2, 2021",
    "verified": true,
    "star_rating": "5.0"
  },
  {
    "body": "",
    "title": "Posting photos",
    "location": "the United States",
    "date": " July 30, 2021",
    "verified": true,
    "star_rating": "5.0"
  },
  {
    "body": "It was working great until it wasn’t. Stopped working within 6 months of having it. Waste of money.",
    "title": "Stopped working within 6 months",
    "location": "the United States",
    "date": " February 1, 2022",
    "verified": true,
    "star_rating": "1.0"
  },
  {
    "body": "El refrigerador me salio dañado de una puerta mal ensamblada en la fabrica metí complain y no me han resuelto nada ni el vendedor ni amazon",
    "title": "Que tengan cuidado de lo que compran",
    "location": "the United States",
    "date": " September 1, 2021",
    "verified": true,
    "star_rating": "1.0"
  },
  {
    "body": "It’s not getting cold need to return it",
    "title": "Not working",
    "location": "the United States",
    "date": " May 12, 2021",
    "verified": true,
    "star_rating": "1.0"
  },
  {
    "body": "These refrigerators cool for about three months, and then stop working.  Have had mine for one year - and just had the fourth service (and lost food every time).  Samsung service is a joke.  This last time I was told the service call and part would be free and they even offered to cover the cost of food lost.  Fantastic - right?  Well, service came out, confirmed no fee, etc.  Then a few days later my credit card was charged over $330.  Samsung confirmed that there should have been no fee (suggesting that Assurion may have charged my card accidentally).  Nope - charge was Samsung.  After two very long calls, they said they would refund the $330.  Waited a week, then called to find out the status.  Get this - THEY CHANGED THEIR MIND and decided to keep the money.  The reason?  Another department at Samsung wanted the money.  That is the word-for-word explanation.  You can't make this stuff up.  WHATEVERY YOU DO - DO NOT BUY A SAMSUNG REFRIGERATOR!!!!",
    "title": "DON'T DO IT",
    "location": "the United States",
    "date": " October 4, 2022",
    "verified": false,
    "star_rating": "1.0"
  },
  {
    "body": "It looks great, fits perfectly, and has so much room. Seems larger than it is, great value for the cost. Would highly recommend.",
    "title": "Looks great,",
    "location": "the United States",
    "date": " September 12, 2021",
    "verified": true,
    "star_rating": "5.0"
  },
  {
    "body": "This refrigerator was delivered very quickly and was everything I was expecting.Delivery guy was terrific , FRIDGE works like a charm. Love the FRENCH doors and overall size .",
    "title": "WONDERFUL DELIVERY AND REFRIGERATOR IS EXACTLY WHAT I WANTED.",
    "location": "the United States",
    "date": " August 24, 2021",
    "verified": true,
    "star_rating": "5.0"
  },
  {
    "body": "Loved it! Exactly what I needed and expected, after 3 months no issues",
    "title": "Extremely well built",
    "location": "the United States",
    "date": " March 1, 2022",
    "verified": true,
    "star_rating": "5.0"
  },
  {
    "body": "this maschine is not im ok  ...no cool ...no normal ...pls return or repair send to meTHIS MASSCHINE IS NOT BUY AGAIN WHY YOU CHARGE ME 1077.40  ?  IS CHANGE FOR MASCHINE  NOT COLD  DAMAGE ....PLS DICIDE THIS PAYMENTTHANK YOU",
    "title": "this maschine not ok",
    "location": "the United States",
    "date": " September 25, 2021",
    "verified": true,
    "star_rating": "1.0"
  },
  {
    "body": "I got so I hated my Samsung, full-size with all the bells & whistles. Ice maker & water dispenser caused so many problems with overheating the fridge that we disconnected them. The counter-depth profile & 28\" width make our kitchen roomier, visually & spatially. Keep it simple.",
    "title": "Great value.",
    "location": "the United States",
    "date": " October 9, 2021",
    "verified": true,
    "star_rating": "5.0"
  },
  {
    "body": "Freezer door has big dent,WTF",
    "title": "Very poor delivery",
    "location": "the United States",
    "date": " July 15, 2021",
    "verified": true,
    "star_rating": "2.0"
  },
  {
    "body": "This item was delivered considerably sooner than estimated - by almost two weeks! Very thankful, though I was not prepared. We plugged it in and did the Quick Freeze option and it really worked. Everything cooled down very very quickly and we were able to load it immediately. Looks very nice, only comment would be the LED fridge light. It’s kind of blue and is not what we are used to, but that’s just an opinion. Tons of room. Had to order white due to other existing appliances (this was a second home turned into a primary home and we weren’t looking to do a lot of expensive changes). We had looked at Home Depot and everything was back ordered and twice this price. Hoping it ends up a good value!",
    "title": "Quick to Cool",
    "location": "the United States",
    "date": " October 9, 2021",
    "verified": true,
    "star_rating": "5.0"
  }
]